import 'medication.dart';

const List<Medication> mockMedications = [
  Medication(
    name: 'Аглепристон (Ализин)',
    description: 'Аглепристон (Ализин) Форма выпуска: Инъекционный раствор 30 мг в 1 мл Синтетический стероид, являющийся антагонистом прогестерона. Нежелательная беременность (до 45 суток), терапевтическое лечение пиометры у собак и кошек (!)Дозы более 5 мл вводить в несколько точек ДОЗА: Собаки: 1. Прерывание бере...',
  ),
  Medication(
    name: 'Адаптил (Феромон лактирующей суки)',
    description: 'Адаптил (Феромон лактирующей суки) Форма выпуска: Раствор для диффузора 48 мл Спрей 60 мл. Содержит структурный аналог феромона лактирующей суки. Использование: Помогает контролировать признаки стресса, связанные с разлукой, чувствительностью к шуму, путешествиями, посещением нового дома, посещением...',
  ),
  Medication(
    name: 'Адреналин (Эпинефрин)',
    description: 'Адреналин (Эпинефрин) Форма выпуска: Р-р д/инъекций 1 мг/мл Сосудосуживающее, противоаллергическое, гипертензивное, бронхолитическое, гипергликемическое средство. Адреналин оказывает свое действие через альфа-1, -2 и бета-1 и -2 адренорецепторы. Приминают при сердечной реанимации, астматическом стат...',
  ),
  Medication(
    name: 'Азатиоприн (Имуран)',
    description: 'Азатиоприн (Имуран) Форма выпуска: Азатиоприн- табли капс 50 мг/кг Иммунодепрессивное средство Ингибирует синтез пуринов, который необходим для пролиферации клеток. Особенно лейкоцитов и лимфоцитов. Хотя точный механизм действия неизвестен, данный препарат подавляет клеточный иммунитет, подавляет пр...',
  ),
  Medication(
    name: 'Азитромицин (Зитромакс, Азикар, Сумалек, Сумамед)',
    description: 'Азитромицин (Зитромакс, Азикар, Сумалек, Сумамед) Форма выпуска: Таблетки и капсулы по 125, 250, 500 мг, суспензия пероральная 20 и 40 мг/мл Лиоф. д/пригот. р-ра для в/в введения 500 мг/фл Макролидный антибиотик. Широкий спектр антимикробного действия Альтернатива пенициллину имеет схожий, хотя и н...',
  ),
  Medication(
    name: 'АКТГ (Синактен, Синактен Депо, Тетракозактид, Косактен)',
    description: 'АКТГ (Синактен, Синактен Депо, Тетракозактид, Косактен) Форма выпуска: Синактен 0,25 мг/мл/амп Синактен Депо 1 мг/мл/амп Синтетический полипептид, обладающий свойствами эндогенного АКТГ. Применяется для диагностики гиперкортицизма (синдром Кушинга) или гипоадренокортицизма (болезнь Аддисона) Являетс...',
  ),
  Medication(
    name: 'Активированный уголь',
    description: 'Активированный уголь Форма выпуска: Табл. 250 и 500 мг Адсорбирующее средство. Оказывает энтеросорбирующее, дезинтоксикационное и противодиарейное действие. Как правило, назначают в дозе в 10 раз превышающей объем принятого токсина. ДОЗА: Собаки, кошки: - После приема токсина: 0,5–4 г/кг перорально...',
  ),
  Medication(
    name: 'Актрапид',
    description: 'Актрапид Форма выпуска: Актрапид НМ раствор для инъекций 100 МЕ/мл 10 мл Инсулин короткого действия Использование: в ОРИТ до стабилизации состояния (затем животное переводят на инсулин средней продолжительности действия/ инсулин длительного действия) ДОЗА: Собаки, кошки: Начальная доза: ИПС 0,05 ед/...',
  ),
  Medication(
    name: 'Алендронат (Алендроновая кислота, Фосмакс, Фороза, Остерепар)',
    description: 'Алендронат (Алендроновая кислота, Фосмакс, Фороза, Остерепар) Форма выпуска: Табл. 70 мг Ингибитор костной резорбции при остеопорозе (за счет ингибирования функции остеокластов). Использование: - Лечение идиопатической гиперкальциемии. - Для уменьшения боли, связанной с остеолитическими заболевания...',
  ),
  Medication(
    name: 'Аллопуринол (Зилорик)',
    description: 'Аллопуринол (Зилорик) Форма выпуска: Таблетки 100, 300 мг Ингибитор фермента ксантиноксидазы Использование: Растворение и предупреждение образования уратных камней у собак, а также лечение лейшманиоза в комбинации с меглумин антимонатом. Для птиц и рептилий в качестве препарата для лечения подагры,...',
  ),
  Medication(
    name: 'Алпразолам (Золомакс, Ксанакс)',
    description: 'Алпразолам (Золомакс, Ксанакс) Форма выпуска: табл 250 мкг, 1 мг Анксиолитик (транквилизатор) повышает активность ГАМК в ЦНС, что приводит к анксиолизу и ряду когнитивных эффектов, включая подавление памяти. Использование: лечение тревожных и связанных со страхом расстройств у собак и кошек, особенн...',
  ),
  Medication(
    name: 'Альбендазол (Немозол)',
    description: 'Альбендазол (Немозол) Форма выпуска: Альбендазол- табл 200 / 400 мг, сусп 20 мг/мл; Немозол- сусп 100 мг/ 5мл; табл 400 мг Противопаразитарное Использование: Для лечения паразитарных инфекций дыхательных путей, включая Capillaria aerophila, Paragonimus kellicotti, Aelurostrongylus abstrusus, Filaroi...',
  ),
  Medication(
    name: 'Альфаксалон',
    description: 'Альфаксалон Форма выпуска: Альфаксан - р-р 10 мг/мл Нейроактивный стероид, общий анестетик Использование: Индукционный агент, используемый перед ингаляционной анестезией или в качестве единственного анестетика при диагностических или хирургических процедурах. Как и все в/в анестетики, премедикация у...',
  ),
  Medication(
    name: 'Альфентанил',
    description: 'Альфентанил Форма выпуска: Рапифен-р-р 0,5 мг/мл опиоидный анальгетик Использование: сильный опиоидный анальгетик (в 10-20 раз более сильный, чем у морфина), используемый для обеспечения интраоперационной анальгезии во время анестезии у собак и кошек. Короткое действие. ДОЗА: Собаки: 0,001-0,005 мг/...',
  ),
  Medication(
    name: 'Алюминия гидроксид гидрат (Алгелдрат) + Магния гидроксид (Альмагель, Маалокс, Альмокс, Фосфалюгель)',
    description: 'Алюминия гидроксид гидрат (Алгелдрат) + Магния гидроксид (Альмагель, Маалокс, Альмокс, Фосфалюгель) Форма выпуска: Суспензия для перорального применения, 218 мг алюминия оксида + 75 мг магния оксида в 5 мл суспензии Антацидный препарат. Применяется как фосфатбиндер при ХПН, при гастритах и язвах жел...',
  ),
  Medication(
    name: 'Амантадин (пк-мерц, Мидантан)',
    description: 'Амантадин (пк-мерц, Мидантан) Форма выпуска: ПК-Мерц- р-р 200 мг/500 мл, табл 100 мг. Мидантан- табл 100 мг, Амантадин- р-р 0,4 мг/мл Противопаркинсонический препарат блокатор глутаматных NMDA-рецепторов Обеспечивает обезболивание за счет действия антагониста NMDA, которое может усиливать действие д...',
  ),
  Medication(
    name: 'Амикацин',
    description: 'Амикацин Форма выпуска: Амикацин - порошок для в/в и в/м введения 0,25, 0,5 и 1 г Селемицин - р-р для в/в и в/м введения 250 мг/мл 2 ml Антибиотик группы аминогликозидов. (!) Нефро- и ототоксичный Использование: грамотрицательные бактерии, устойчивые к гентамицину. ДОЗА: (!)Внутривенное введение до...',
  ),
  Medication(
    name: 'Аминофиллин (Эуфиллин)',
    description: 'Аминофиллин (Эуфиллин) Форма выпуска: Р-р д/в/в введения 24 мг/мл амп по 5 и 10 мл Табл. 150 мг Фармакологическое действие - бронходилатирующее, диуретическое, спазмолитическое, вазодилатирующее. Спазмолитическое с мягким мочегонным эффектом. Использование: Используется при отёке лёгких,а также как ...',
  ),
  Medication(
    name: 'Амиодарон (Кордарон)',
    description: 'Амиодарон (Кордарон) Форма выпуска: Табл. 200 мг. Конц. д/пригот. р-ра д/в/в введения 150 мг/3 мл Антиангинальное, антиаритмическое. Использование: при желудочков и суправентрикулярных аритмиях. ДОЗЫ: Собаки: - Перорально: 10–15 мг/кг каждые 12 часов в течение 7 дней, затем 5–7,5 мг/кг каждые 12 час...',
  ),
  Medication(
    name: 'Амитраз (Промерис дуо, Амитразин)',
    description: 'Амитраз (Промерис дуо, Амитразин) Форма выпуска: Спот-он, а также жидкости с разной концентрацией действующего вещества Противопаразитарный препарат Активен против блох, демодексов, саркоптесов ДОЗА: Собаки: - Генерализованный демодекоз 0,05% раствор q 5-7 дн до 2 негативных соскобов, - Саркоптоз 0...',
  ),
  Medication(
    name: 'Амитриптилин',
    description: 'Амитриптилин Форма выпуска: Таблетки по 10, 25 мг, амп. 10 мг/мл Трициклический антидепрессант, блокирует обратный захват серотонина. Использование: Для контроля компульсивных расстройств, гипервозбуждения, при гипервокализации и идиопатическом цистите кошек, психогенных алопециях ДОЗА: Собаки: 1-2...',
  ),
  Medication(
    name: 'Амоксициллин (Бетамокс, Бимоксил)',
    description: 'Амоксициллин (Бетамокс, Бимоксил) Форма выпуска: Бетамокс- сусп 150 мг/мл, Бимоксил- сусл 150 мг/мл, Амоксициллин- супен 250 мг/5 мл; капс 250 / 500 / 1000 мг; табл 250/ 500/1000 мг; Антибактериальный препарат группы полусинтетических пенициллинов Использование: Бета-лактамный антибиотик. Амоксицилл...',
  ),
  Medication(
    name: 'Амоксициллин + клавулановая кислота(Амоксициллин клавунат, Амоксиклав, Кладакса, Синулокс, Синуксол, Амклав, Амоксиван, Амоксигард)',
    description: 'Амоксициллин + клавулановая кислота(Амоксициллин клавунат, Амоксиклав, Кладакса, Синулокс, Синуксол, Амклав, Амоксиван, Амоксигард) Форма выпуска: Раствор для в/м и п/к введения Амоксигард (вет) 140+35 мг/мл Синуксол/Кладакса (вет) табл. 40+10 мг, 200+50 мг, 400+100 мг Порошок для приготовления сусп...',
  ),
  Medication(
    name: 'Амолдипин (Норваск, Амлотоп)',
    description: 'Амолдипин (Норваск, Амлотоп) Форма выпуска: Табл. 5 мг, табл. 10 мг Блокатор кальциевых каналов. Антиангинальное, гипотензивное средство. Использование: При системной гипертензии у кошек, безопасен при почечной недостаточности. Эффективность при лечении системной гипертензии у собак под вопросом. ДО...',
  ),
  Medication(
    name: 'Ампициллин',
    description: 'Ампициллин Форма выпуска: Ампициллин натриевая соль: Порошок д/пригот р-ра д/в/в и в/м введения 500 мг, 1 г Ампициллина тригидрат: Таблетки, капсулы по 250 мг. Антибиотик пенициллинового ряда. При инфекционных заболеваниях, вызванных чувствительными бактериями. Не действует на бактерии, продуцирующи...',
  ),
  Medication(
    name: 'Ампролиум 30%',
    description: 'Ампролиум 30% Форма выпуска: Порошок для орального применения 300 мг Препарат, нарушающий метаболизм простейших Использование: Противококцидиозный препарат у кошек и собак. (!)Продолжительность терапии не более 2-х недель. ДОЗЫ: Собаки: - 200–300 мг/собаку перорально. каждые 24 часа в течение 7–12 д...',
  ),
  Medication(
    name: 'Амфотерицин В',
    description: 'Амфотерицин В Форма выпуска: - Амбизом- порошок 50 мг/фл, - Амфолип-р-р 10 мг/2 мл, - Амфотерицин В- лиофилизат 50 тыс Ед (мкг) /фл - Амфотерицин В липосомальный- лиофилизат 50 мг/фл (!)Примечание: для Амфотерицин В 1 000 000 ЕД = 1 г Противогрибковое средство Использование: Лечение системных грибко...',
  ),
  Medication(
    name: 'Антепсин(Вентер,  Сукральфат)',
    description: 'Антепсин(Вентер, Сукральфат) Форма выпуска: таблетки 1 гр Обволакивающий препарат. Применяется в лечении эзофагиальных, желудочных и дуоденальных эрозий и язв. ДОЗА: Собаки: 500 мг на собаку п/о с интервалом 6-8 часов (собаки до 20 кг); 1-2 гр на собаку п/о с интервалом 6-8 часов (собаки более 20 к...',
  ),
  Medication(
    name: 'Антиседан (Атипамезол, Антимедин,  Алзан)',
    description: 'Антиседан (Атипамезол, Антимедин, Алзан) Форма выпуска: Инъекционный раствор, 5 мг/мл Селективный антагонист α2- адренорецепторов. - Устранение действия медетомидина, дексмедетомидина. - По времени действия выводится быстрее, чем альфа-2 агонисты, поэтому седативный эффект может вернуться ДОЗА: Соб...',
  ),
  Medication(
    name: 'Апоквел (Оклацитиниба малеват)',
    description: 'Апоквел (Оклацитиниба малеват) Форма выпуска: табл. 3.6 мг, 5.4 мг, 16 мг. Слелективный ингибитор янус-киназы - семейства внутриклеточных белков, которые передают индуцированные цитокинами сигналы. Препарат от зуда. ДОЗА: Собаки: 0,4-0,6 мг/кг внутрь каждые 12 часов. Кошки: 1,0-1,2 мг/кг внутрь каж...',
  ),
  Medication(
    name: 'Аргинин (L-аргинин, Глутаргин, Аргинин глутамат)',
    description: 'Аргинин (L-аргинин, Глутаргин, Аргинин глутамат) Форма выпуска: Табл или капс. 250 мг, 750 мг, 1000 мг. Аминокислота. Использование: При заболеваниях печени у кошек, особенно печеночном липидозе, в качестве добавки к диете. ДОЗА: Собаки: нет данных Кошки: 1000 мг на кошку внутрь 1 раз в 24 часа.',
  ),
  Medication(
    name: 'Аскорбиновая кислота (Витамин C)',
    description: 'Аскорбиновая кислота (Витамин C) Форма выпуска: Инъекционный раствор по 50 мг/ мл, 100 мг/мл, различные варианты таблеток, драже и порошков Витамин Использование: Метгемоглобинемия из-за отравления парацетамолом. Возможно кратковременное использование для кахексичных пациентов. В-основном использует...',
  ),
  Medication(
    name: 'Аспарагиназа (Элспар, Эрвиназа)',
    description: 'Аспарагиназа (Элспар, Эрвиназа) Форма выпуска: Лиолизат д/пригот. р-ра 5 тыс МЕ, 10 тыс МЕ Противоопухолевый препарат Фермент, лишающий опухолевые клетки аспарагина. Часто сочетается с другими препаратами при Т-клеточных лимфомах. ДОЗА: Кошки, собаки: L-аспарагиназа в моно-режиме может применяться в...',
  ),
  Medication(
    name: 'Аспирин (Ацетилсалициловая кислота)',
    description: 'Аспирин (Ацетилсалициловая кислота) Форма выпуска: Табл. 100 мг, 500 мг Фармакологическое действие - противовоспалительное, жаропонижающее, антиагрегационное, анальгезирующее. Использование: Профилактика артериальной тромбоэмболии. Последние исследования свидетельствуют о том, что клопидогрель прево...',
  ),
  Medication(
    name: 'Атенолол (Тенормин, Бетакард)',
    description: 'Атенолол (Тенормин, Бетакард) Форма выпуска: табл 25, 50, 100 мг Бета1-адреноблокатор - Лечение сердечных тахиаритмий (в том числе связанных с кошачьим гипертиреозом); - Лечение гипертрофической обструктивной кардиомиопатии (кошки) или обструктивной болезни сердца (тяжелый аортальный или легочный ст...',
  ),
  Medication(
    name: 'Атракурия безилат (Атракурий, Тракриум)',
    description: 'Атракурия безилат (Атракурий, Тракриум) Форма выпуска: Р-р д/в/в введения 10 мг/мл/ фл или амп. Миорелаксант недеполяризующий периферического действия. Вызывает паралич скелетных мышц, включая дыхательные, но не влияет на сознание. Использование: - Нервно-мышечная блокада во время анестезии (когда ж...',
  ),
  Medication(
    name: 'Атрпопин (Атропина сульфат)',
    description: 'Атрпопин (Атропина сульфат) Форма выпуска: Капли глазные 1% фл. Р-р д/инъекц. 1 мг/мл амп. Антихолинергический (м-холинолитик), растительный алкалоид. Используется для предупреждения и контроля брадикардии и брадиаритмии. При отравлении органофосфатами и карбаматами. В офтальмологии используется для...',
  ),
  Medication(
    name: 'Афоксоланер (Фронтлайн НексгарД)',
    description: 'Афоксоланер (Фронтлайн НексгарД) Форма выпуска: жевательные таблетки, в 1 таблетке 11,3 мг (вес 2-3 кг); 28,3 мг (вес 4-10 кг); 68 мг (вес 1-25 кг) и 136 мг (вес 25-50 кг) Противопаразитарный препарат. Использование: Спектр действия включает иксодовых клещей, блох, клещей Demodex, Otodectes, Sarcopt...',
  ),
  Medication(
    name: 'Афоксоланер + мильбемицина оксим (Нексгард Спектра)',
    description: 'Афоксоланер + мильбемицина оксим (Нексгард Спектра) Форма выпуска: жевательные таблетки, в 1 таблетке (афоксоланер + мильбемицин) 9,4 мг+1,9 мг (вес 2-3,5 кг); 18.8мг + 3,8 мг (вес 3,5-7,5 кг); 37,5 мг + 7,5 мг. (вес 7,5-15 кг); 75 мг + 15 мг (вес 15-30 кг); 150 мг + 30 мг (вес 30-60 кг) Комбинирова...',
  ),
  Medication(
    name: 'Ацепромазина малеат (Комбистресс, Неуротранк, Седан)',
    description: 'Ацепромазина малеат (Комбистресс, Неуротранк, Седан) Форма выпуска: Комбистресс- 2% р-р (20 мг/мл), Неуротранк- 1% р-р (10 мг/мл), Седан-р-р 10 мг/мл Фенотиазиновый седативный/ транквилизатор. Обладает незначительным обезболивающий эффектом. Может вызывать выраженную гипотензию нарушения сердечного...',
  ),
  Medication(
    name: 'Ацетазоламид (Диакарб)',
    description: 'Ацетазоламид (Диакарб) Форма выпуска: - Диакарб-табл 250 мг, - Ацетазоламид- табл 250 мг Диуретик Системный ингибитор карбоангидразы. Используется при метаболическом алкалозе или острой глаукоме у мелких животных. Не считается препаратом выбора для длительного контроля ДОЗА: Собаки: - 4-8 мг/кг перо...',
  ),
  Medication(
    name: 'Ацетаминофен (Парацетамол)',
    description: 'Ацетаминофен (Парацетамол) Форма выпуска: Табл. 200 мг, 500 мг Сироп 125 мг/5 мл р-р д/инф. 10 мг/мл Фармакологическое действие: Анальгетическое ненаркотическое средство. Использование: Ацетаминофен раньше использовался как болеутоляющее и обезболивающее у собак. Считается относительно слабым анальг...',
  ),
  Medication(
    name: 'Ацетилцистеин (АЦЦ, Флуимуцил, N-ацетилцистеин)',
    description: 'Ацетилцистеин (АЦЦ, Флуимуцил, N-ацетилцистеин) Форма выпуска: Порошок д/пригот. р-ра д/приема внутрь 100 мг, 200 мг, 600 мг. Сироп 20 мг/мл. Раствор для в/в и в/м введ. 100 мг/1 мл. Фармакологическое действие - отхаркивающее, муколитическое, детоксицирующее. Использование: Снижает вязкость бронхиал...',
  ),
  Medication(
    name: 'Ацикловир',
    description: 'Ацикловир Форма выпуска: табл 200 и 400 мг Зовиракс - крем 5%, Ацикловир - крем / мазь 5%, мазь глазная 3% Виворакс-крем 5%, Герперакс-крем 5%, Противовирусный препарат. Ингибирует репликацию вируса (вирусная ДНК-полимераза); Использование: При лечении герпетических инфекций у различных видов птиц ...',
  ),
  Medication(
    name: 'Бария сульфат',
    description: 'Бария сульфат Форма выпуска: порошок для приготовления раствора для рентгенологического исследования Рентгенологический контраст Использование: диагностика непроходимости кишечника/наличия инородного тела при отсутствии узи: 1. Рентген без бария 2. Смешать вазелиновое масло(если его нет, то кефир ил...',
  ),
  Medication(
    name: 'Безафибрат (Безалип)',
    description: 'Безафибрат (Безалип) Форма выпуска: табл 400 мг Гиполипидемическое средство Использование: Эффективен при лечении гиперлипидемии, устойчивой к диетическому лечению в течение как минимум 1 месяца (т. е. диете с низким содержанием жиров: многие авторы дополнительно рекомендуют добавки жирных кислот ом...',
  ),
  Medication(
    name: 'Беназеприла гидрохлорид (Фортекор, Кардалис)',
    description: 'Беназеприла гидрохлорид (Фортекор, Кардалис) Форма выпуска: Фортекор- табл 5 мг и 20 мг, Кардалис- беназеприла гидрохлорид + спиронолактон - таблетки - 2,5 мг+20 мг; 5 мг +40 мг; 10 мг + 80 мг Cосудорасширяющее средство, ингибитор ангиотензинпревращающего фермента (АПФ). Использование: - Лечение зас...',
  ),
  Medication(
    name: 'Бетанехол',
    description: 'Бетанехол Форма выпуска: табл. 25 мг Активные вещества: Бетанехол Селективный стимулятор М2-холинорецепторов, повышает тонус мышцы детрузора мочевого пузыря, обычно вызывая сокращение, достаточно сильное, чтобы вызвать мочеиспускание и опорожнить мочевой пузырь. Стимулирует перистальтику желудка, по...',
  ),
  Medication(
    name: 'Бетасерк',
    description: 'Бетасерк Форма выпуска: Табл 8, 16 и 24 мг Препарат для лечения идиопатического вестибулярного синдрома ДОЗА: Собаки, кошки: 0,25-0,5 мг/кг внутрь 2 раза в день 2-4 недели',
  ),
  Medication(
    name: 'Бикарбонат натрия (Гидрокарбонат натрия)',
    description: 'Бикарбонат натрия (Гидрокарбонат натрия) Форма выпуска: - Натрия Гидрокарбонат-5%, 40 мг в 1 мл, 42мг/ 1 мл, 84 мг/1 мл - Натрия Бикарбонат- р-р для инфузии 8,4% Препарат для коррекции ацидоза для парентерального применения. Используется для лечения тяжелого метаболического ацидоза, подщелачивания м...',
  ),
];
